import { WorkHomes } from '@/types/workHomes'

export const workHomes: WorkHomes[] = [
  {
    name: 'allmaster.vercel.app',
    slug: 'allmaster.vercel.app',
    location: 'https://allmaster.vercel.app',
    rate: '100,000',
    details: 'Html, Css, Java, JavaScript, Python, TypeScript, React, Next.js, Node.js, Hook, Firebase, MySQL, MongoDB, Api, Google Ads, SEO, Social Management, Creative Content Creation, Media Design & Branding',
    contronl: 'Git Hub, Vercel, Chrome Dev Tool, Postman, Figma, VS Code',
    creation: 'Responsive design, Tailwind CSS, Framer Motion, AOS, Swiper.js, Google Fonts, Radix UI, HeroUI',
    images: [
      { src: "/images/works/work1/1.webp" },
      { src: "/images/works/work1/2.webp" },
    ],
    description: [
      { title: 'เว็บไซต์ AllM Master (allmaster.vercel.app) เป็นผู้ให้บริการรับทำเว็บไซต์และออกแบบ UX/UI ที่นำเสนอจุดขายหลักผ่านแพ็กเกจบริการที่ชัดเจน ครอบคลุมความต้องการของลูกค้าในหลายระดับ ตั้งแต่เว็บไซต์แบบหน้าเดียว (Salepage) ไปจนถึงเว็บไซต์ธุรกิจเต็มรูปแบบและ E-Commerce โดยข้อดีของเว็บไซต์นี้คือการอธิบายรายละเอียดของแพ็กเกจอย่างครบถ้วนและเข้าใจง่าย ระบุชัดเจนว่าลูกค้าจะได้รับอะไรบ้าง ไม่ว่าจะเป็นจำนวนหน้าเว็บไซต์ การรองรับทุกหน้าจอ (Responsive) ฟรีโดเมน ฟรีโฮสติ้ง ระบบจัดการหลังบ้าน การทำ SEO รวมถึงการจำกัดจำนวนครั้งในการแก้ไขงาน ซึ่งช่วยให้ลูกค้ามองเห็นความคุ้มค่าของแต่ละแพ็กเกจได้ทันที อีกทั้งยังมีการแสดงราคาที่ตรงไปตรงมา (แม้จะยังไม่รวมภาษีมูลค่าเพิ่ม) พร้อมช่องทางการติดต่อที่หลากหลาย เช่น เบอร์โทรศัพท์และอีเมล นอกจากนี้ตัวเว็บไซต์ยังนำเสนอผลงานจริง ตัวอย่างการออกแบบที่สร้างแรงบันดาลใจ รีวิวจากลูกค้าผู้ใช้งานจริง และบทความสาระในด้านอสังหาริมทรัพย์และธุรกิจออนไลน์ ทำให้ AllM Master ไม่ได้เป็นเพียงแค่ผู้รับทำเว็บไซต์ แต่ยังเป็นพาร์ทเนอร์มืออาชีพที่พร้อมช่วยต่อยอดธุรกิจให้เติบโตอย่างมั่นคง ทั้งในแง่ภาพลักษณ์และกลยุทธ์ออนไลน์อย่างครบวงจร' },
    ],
  },
  {
    name: 'ktltc.vercel.app',
    slug: 'ktltc.vercel.app',
    location: 'https://ktltc.vercel.app',
    rate: '1,900,000',
    images: [
      { src: "/images/works/work2/1.webp", },
      { src: "/images/works/work2/2.webp", },
      { src: "/images/works/work2/3.webp", },
      { src: "/images/works/work2/4.webp", },
      { src: "/images/works/work2/5.webp", },
      { src: "/images/works/work2/6.webp", },
      { src: "/images/works/work2/7.webp", },
      { src: "/images/works/work2/8.webp", },
      { src: "/images/works/work2/9.webp", },
    ],
    description: [
      { title: 'เว็บไซต์ ktltc.vercel.app เป็นเว็บทางการของวิทยาลัยเทคนิคกันทรลักษ์ที่ออกแบบอย่างเรียบง่ายและชัดเจนในเชิงโครงสร้าง โดยเน้นการนำเสนอเนื้อหาในสไตล์ minimalist เพื่อให้ผู้เข้าชมสามารถโฟกัสกับสิ่งที่สำคัญได้ทันทีโดยไม่ถูกรบกวนจากองค์ประกอบที่ซับซ้อนหรือข้อมูลที่ไม่จำเป็น การจัดวางหน้าตาดูสะอาดตา ใช้ฟอนต์ที่อ่านง่าย และด้วยความที่ไม่มีไฟล์กราฟิกหนักหรือเอฟเฟกต์ที่ซับซ้อนมากนัก จึงทำให้เว็บไซต์โหลดได้รวดเร็ว ซึ่งเป็นข้อดีอย่างยิ่งต่อประสบการณ์ใช้งานของผู้เข้าชม ขณะเดียวกันเว็บไซต์ยังทำหน้าที่เป็น ศูนย์กลางข้อมูลและการประชาสัมพันธ์ ของวิทยาลัย เช่น ข่าวสารกิจกรรม กำหนดการสมัครเรียน และประกาศสำคัญต่าง ๆ พร้อมเชื่อมต่อไปยังโซเชียลมีเดียอย่าง Facebook และ YouTube ทำให้ผู้ใช้เข้าถึงข้อมูลได้ครบถ้วน สะดวก และมีประสิทธิภาพในที่เดียว' },
    ],
    details: 'Html, Css, Java, JavaScript, Python, TypeScript, React, Next.js, Node.js, Hook, Firebase, MySQL, MongoDB, Api, Google Ads, SEO, Social Management, Creative Content Creation, Media Design & Branding',
    contronl: 'Git Hub, Vercel, Chrome Dev Tool, Postman, Figma, VS Code',
    creation: ''
  },
  {
    name: 'ktltcp.vercel.app',
    slug: 'ktltcp.vercel.app',
    location: 'https://ktltcp.vercel.app',
    rate: '10,000',
    details: 'Html, Css, Java, JavaScript, Python, TypeScript, React, Next.js, Node.js, Hook, Firebase, MySQL, MongoDB, Api, Google Ads, SEO, Social Management, Creative Content Creation, Media Design & Branding',
    contronl: 'Git Hub, Vercel, Chrome Dev Tool, Postman, Figma, VS Code',
    creation: 'Responsive design, Tailwind CSS, Framer Motion, AOS, Swiper.js, Google Fonts, Radix UI, HeroUI',
    images: [
      {
        src: "/images/works/work3/1.webp",
      },
      {
        src: "/images/works/work3/2.webp"
      },
      {
        src: "/images/works/work3/3.webp"
      },
    ],
    description: [
      { title: 'เว็บไซต์นี้ถูกออกแบบมาในลักษณะ Dashboard สำหรับการติดตามแผนงานและความร่วมมือ ภายในหน่วยงานการศึกษา (ชื่อที่แสดงคือ “วิทยาลัยเทคนิคเกษมสำราญ” หรือ KTLTC) โดยมีเมนูหลักที่แยกเป็น 3 ส่วน ได้แก่' },
      { title: '1. Dashboard → หน้าแสดงภาพรวมของแผนงานและความร่วมมือที่ดำเนินการในปีงบประมาณปัจจุบัน (เช่น ปี 2567)' },
      { title: '2. Edit PDCA → ฟังก์ชันแก้ไขและปรับปรุงข้อมูลตามวงจร PDCA (Plan-Do-Check-Act) เพื่อให้ผู้รับผิดชอบสามารถอัปเดตความก้าวหน้าของแต่ละโครงการ' },
      { title: '3. Chart → ส่วนแสดงผลในรูปแบบกราฟหรือแผนภาพ เพื่อช่วยวิเคราะห์ความคืบหน้าของงานได้ชัดเจนขึ้น' },
      { title: 'ในหน้า Dashboard จะมีการ์ดแสดงโครงการของแต่ละฝ่าย เช่น “งานศูนย์ข้อมูลและสารสนเทศ” หรือ “งานความร่วมมือ” โดยในแต่ละโครงการจะมีการบันทึกรายการงานเป็นข้อ ๆ (เช่น การขออนุมัติโครงการ, การจัดประชุม, การเชิญประชุม, การจัดกิจกรรม, การสรุปรายงานผล, และการวิเคราะห์ข้อมูล) พร้อม checkbox ที่แสดงสถานะว่าทำแล้วหรือยัง ข้อมูลที่ปรากฏทำให้สามารถตรวจสอบได้อย่างรวดเร็วว่าโครงการเดินหน้าไปถึงขั้นไหนแล้ว' },
      { title: 'ความโดดเด่นคือ ความเป็นระบบและความโปร่งใส เพราะทุกงานย่อยถูกลิสต์ออกมาอย่างละเอียด ทำให้ผู้บริหารและผู้ปฏิบัติงานเห็นภาพรวมของโครงการได้ทันที นอกจากนี้ยังมี timestamp แสดงวันที่อัปเดตข้อมูลล่าสุด เพื่อบอกถึงความทันสมัยของข้อมูลอีกด้วย' },
      { title: 'อย่างไรก็ตาม หากมองในเชิงพัฒนาเพิ่มเติม ระบบนี้ยังสามารถขยายศักยภาพได้ เช่น การเชื่อมต่อกับฐานข้อมูลกลางเพื่อเก็บข้อมูลย้อนหลังหลายปี, การเพิ่มระบบอัปโหลดไฟล์เอกสาร/หลักฐานประกอบงาน, การแจ้งเตือนอัตโนมัติเมื่องานใกล้ถึงกำหนด, หรือการ export รายงานออกเป็นไฟล์ Excel/PDF สำหรับส่งต่อให้หน่วยงานอื่น ๆ' },
    ],
  },
  {
    name: 'sonklin.vercel.app',
    slug: 'sonklin.vercel.app',
    location: 'https://sonklin.vercel.app',
    rate: '50,000',
    details: 'Html, Css, Java, JavaScript, Python, TypeScript, React, Next.js, Node.js, Hook, Firebase, MySQL, MongoDB, Api, Google Ads, SEO, Social Management, Creative Content Creation, Media Design & Branding',
    contronl: 'Git Hub, Vercel, Chrome Dev Tool, Postman, Figma, VS Code',
    creation: 'Responsive design, Tailwind CSS, Framer Motion, AOS, Swiper.js, Google Fonts, Radix UI, HeroUI',
    images: [
      {
        src: "/images/works/work4/1.webp",
      },
      {
        src: "/images/works/work4/2.webp"
      },
      {
        src: "/images/works/work4/3.webp"
      },
    ],
    description: [
      { title: 'เว็บไซต์นี้ถูกออกแบบมาเพื่อเป็น ร้านค้าออนไลน์สำหรับจำหน่ายขนมไทย ภายใต้ชื่อ “Sonklin” โดยมีการจัดวางหน้าเว็บให้เรียบง่ายและทันสมัยในสไตล์ e-commerce สมัยใหม่ ด้านบนสุดมีเมนูหลัก ได้แก่ Home, Shop, About Us, Contact พร้อมไอคอนค้นหาและ Account สำหรับการเข้าสู่ระบบหรือลงทะเบียนสมาชิก' },
      { title: 'เมื่อเข้ามาในหน้าแรก ผู้ใช้งานจะพบกับ แบนเนอร์โปรโมชันหลัก ที่เน้นนำเสนอเอกลักษณ์ของขนมไทย เช่น “ขนมต้ม” ที่ถูกนำเสนอด้วยข้อความบรรยายถึงคุณค่า ความหมาย และรสชาติ เช่น ความหอมหวานและความเป็นมงคล พร้อมปุ่ม Shop Now ที่กระตุ้นให้ผู้ชมเลือกซื้อได้ทันที' },
      { title: 'ถัดลงมาเป็นหมวดหมู่ สินค้ายอดนิยม ซึ่งในภาพที่ปรากฏคือชุดขนมบูชาพร้อมแพ็กเกจหรูหรา มีการแสดงชื่อสินค้า, ราคา, เรตติ้งรีวิว (ดาว) เพื่อสร้างความน่าเชื่อถือ และทำให้ผู้ใช้ตัดสินใจได้ง่ายขึ้น การจัดวางเน้นความเป็นระเบียบ โล่ง โปร่งตา โดยเลือกใช้โทนสีอ่อนและปุ่ม CTA สีส้มเพื่อดึงดูดสายตา' },
      { title: 'จากโครงสร้างเว็บไซต์นี้สะท้อนว่า ผู้พัฒนาเน้นความเป็น ร้านค้าออนไลน์เชิงวัฒนธรรมไทย ที่ผสมผสานความคลาสสิกของขนมไทยเข้ากับความสะดวกในการสั่งซื้อออนไลน์ จุดแข็งอยู่ที่การเล่าเรื่อง (storytelling) ของสินค้า ซึ่งไม่ได้เพียงแค่ขายขนม แต่ยังบอกเล่าถึงคุณค่า ความหมาย และความพิเศษของแต่ละเมนูที่สืบทอดจากวัฒนธรรมไทย' },
      { title: 'โดยรวมแล้ว sonklin.vercel.app เป็นเว็บไซต์ที่เหมาะสำหรับผู้ที่ต้องการทั้งเรียนรู้และสั่งซื้อขนมไทยออนไลน์ ด้วยการออกแบบที่สะอาด ใช้งานง่าย และช่วยยกระดับขนมไทยให้ดูพรีเมียม เหมาะกับการทำเป็นแบรนด์ขนมไทยออนไลน์ที่เข้าถึงลูกค้ารุ่นใหม่ได้ดีครับ 🍡✨' },
    ],
  },
]